TransportManagementDevelop_KAT/Конфигурация/src/InformationRegisters/гкс_КодыПоказателейКачестваЛИМС/гкс_КодыПоказателейКачестваЛИМС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>гкс_КодыПоказателейКачестваЛИМС</name>
  <resources>
    <name>КодЛИМС</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Показатель</name>
    <type>
      <types>CatalogRef.гкс_ПоказателиАнализовНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТочкаМаршрута</name>
    <type>
      <types>CatalogRef.гкс_ТочкиМаршрута</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипРегистрации</name>
    <type>
      <types>EnumRef.гкс_ТипРегистрации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипПробы</name>
    <type>
      <types>EnumRef.гкс_ТипыПроб</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидПеревозки</name>
    <type>
      <types>EnumRef.гкс_ТипыТранспортныхСредствДоставки</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Весы</name>
    <type>
      <types>CatalogRef.гкс_ОборудованиеПЛК</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

TransportManagementDevelop_KAT/Конфигурация/src/InformationRegisters/гкс_КодыПоказателейКачестваЛИМС/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс

// Функция - Получить показатель качества по коду ЛИМС
//
// Параметры:
//  Код	- Строка - код показателя ЛИМС
//  ТочкаМаршрута - СправочникСсылка.гкс_ТочкиМаршрута - Точка маршрута для которой определяется показатель
// 
// Возвращаемое значение:
//  СправочникСсылка.гкс_ПоказателиАнализовНоменклатуры - найденный показатель анализа номенклатуры или пустая ссылка
//
Функция ПолучитьПоказательКачестваПоКодуЛИМС(Код, ТочкаМаршрута) Экспорт
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("КодЛИМС", Код);
	Запрос.УстановитьПараметр("ТочкаМаршрута", ТочкаМаршрута);

	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	КодыПоказателейКачестваЛИМС.Показатель КАК Показатель
	|ИЗ
	|	РегистрСведений.гкс_КодыПоказателейКачестваЛИМС КАК КодыПоказателейКачестваЛИМС
	|ГДЕ
	|	КодыПоказателейКачестваЛИМС.ТочкаМаршрута = &ТочкаМаршрута
	|	И КодыПоказателейКачестваЛИМС.КодЛИМС = &КодЛИМС";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Показатель;	
	КонецЕсли;
	
	Возврат Справочники.гкс_ПоказателиАнализовНоменклатуры.ПустаяСсылка();

КонецФункции

// Инициализирует параметры для получения сопоставления показателей.
// 
// Возвращаемое значение:
//  Структура - Инициализировать параметры сопоставления показателей:
// * Показатели - Неопределено
// * ТочкаМаршрута - Неопределено 
// * Номенклатура - Неопределено 
// * ТипПробы - Неопределено
// * ВидПеревозки - Неопределено 
Функция ИнициализироватьПараметрыСопоставленияПоказателей() Экспорт
	
	ПараметрыСопоставления = Новый Структура;
	ПараметрыСопоставления.Вставить("Показатели"	, Неопределено);
	ПараметрыСопоставления.Вставить("ТочкаМаршрута"	, Неопределено);
	ПараметрыСопоставления.Вставить("Номенклатура"	, Неопределено);
	ПараметрыСопоставления.Вставить("ТипПробы"		, Неопределено);
	ПараметрыСопоставления.Вставить("ВидПеревозки"	, Неопределено);
	
	Возврат ПараметрыСопоставления;
	
КонецФункции

// Проверяет для переданых показателей анализов наличие записей в регистре и возвращает таблицу значений,
// где для каждого показателя устанвливается признак НетСопоставленияЛИМС - Истина, если по переданным параметрам
// КодЛИМС не найден, Ложь в противном случае.
// 
// Если в регистре нет ни одной записи, будет возвращена пустая таблица значений.
// 
// Параметры:
//  ПараметрыСопоставления - Структура - см. ИнициализироватьПараметрыСопоставленияПоказателей()
// 
// Возвращаемое значение:
//  ТаблицаЗначений - Сопоставление показателей по параметрам
Функция СопоставлениеПоказателейПоПараметрам(ПараметрыСопоставления) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Показатели"		, ПараметрыСопоставления.Показатели);
	Запрос.УстановитьПараметр("ТочкаМаршрута"	, ПараметрыСопоставления.ТочкаМаршрута);
	Запрос.УстановитьПараметр("Номенклатура"	, ПараметрыСопоставления.Номенклатура);
	Запрос.УстановитьПараметр("ВидПеревозки"	, ПараметрыСопоставления.ВидПеревозки);
	Запрос.УстановитьПараметр("ТипПробы"		, ПараметрыСопоставления.ТипПробы);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПоказателиАнализовНоменклатуры.Ссылка КАК Показатель
	|ПОМЕСТИТЬ ПоказателиАнализовНоменклатуры
	|ИЗ
	|	Справочник.гкс_ПоказателиАнализовНоменклатуры КАК ПоказателиАнализовНоменклатуры
	|ГДЕ
	|	ПоказателиАнализовНоменклатуры.Ссылка В (&Показатели)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПоказателиАнализовНоменклатуры.Показатель КАК ПоказательАнализа,
	|	МАКСИМУМ(КодыПоказателейКачестваЛИМС.КодЛИМС ЕСТЬ NULL) КАК НетСопоставленияЛИМС
	|ИЗ
	|	ПоказателиАнализовНоменклатуры КАК ПоказателиАнализовНоменклатуры
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.гкс_КодыПоказателейКачестваЛИМС КАК КодыПоказателейКачестваЛИМС
	|		ПО ПоказателиАнализовНоменклатуры.Показатель = КодыПоказателейКачестваЛИМС.Показатель
	|		И КодыПоказателейКачестваЛИМС.ТочкаМаршрута = &ТочкаМаршрута
	|		И КодыПоказателейКачестваЛИМС.Номенклатура = &Номенклатура
	|		И КодыПоказателейКачестваЛИМС.ТипПробы = &ТипПробы
	|		И КодыПоказателейКачестваЛИМС.ВидПеревозки = &ВидПеревозки
	|ГДЕ
	|	1 В
	|		(ВЫБРАТЬ ПЕРВЫЕ 1
	|			1
	|		ИЗ
	|			РегистрСведений.гкс_КодыПоказателейКачестваЛИМС КАК КодыПоказателейКачестваЛИМС)
	|СГРУППИРОВАТЬ ПО
	|	ПоказателиАнализовНоменклатуры.Показатель";
	РезультатЗапроса = Запрос.Выполнить();
	Возврат РезультатЗапроса.Выгрузить();
	
КонецФункции

#КонецОбласти

#КонецЕсли
